app/controllers/questions_controller.rb

SELECT * FROM "questions" ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @questions = Question.paginate(:all , :page => params[:page] , :per_page => 10 , :order => 'created_at DESC')

INSERT INTO "questions" ("updated_at", "title", "body", "user_id", "created_at") VALUES('2009-04-07 14:44:11', 'how to install RAils', 'sudo gem install rails', 1, '2009-04-07 14:44:11')
---
  def create
    @question = Question.new(params[:question])
    @question.user = current_user
    if @question.save

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
---
  def show
    @question = Question.find(params[:id])