app/controllers/users_controller.rb

 def create
   @user = User.new(params[:user])
   if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "login", "last_login_ip", "email", "created_at") VALUES(NULL, '2009-04-07 00:40:47', '2009-04-07 00:40:47', '1e12726cf3ec0886ca14ba9c5ca2c56fc66d1eebc79599cb44de0cad298e2dcf52b2fd13396ab7c1ac880c7f41f7a01feddc235f7333fb8571dc787dc5672910', '127.0.0.1', 'ywGFqyuE-_lSY2jiBdyT', '2009-04-07 00:40:47', '60249e576d9e714813997b0df2a5e4b6ea823a0434151bbe2a06493ade08fdcc4192457b1d1ef7e4432b51ff9ee852500879de8073acc4d9a94867b2077b3982', 1, 'test', NULL, 'nicolas55ar@gmail.com', '2009-04-07 00:40:47')